#+TITLE: Development Log
#+AUTHOR: Ray Perry
#+EMAIL: rperry@pmmimediagroup.com

* Time spent on this project
#+BEGIN: clocktable :maxlevel 2 :scope subtree
#+CAPTION: Clock summary at [2017-09-19 Tue 14:05]
| Headline                   | Time       |         |
|----------------------------+------------+---------|
| *Total time*               | *1d 19:29* |         |
|----------------------------+------------+---------|
| Time spent on this project | 1d 19:29   |         |
| \_  Communicating          |            |    0:42 |
| \_  Lunch/Breaks           |            |    2:06 |
| \_  Bootstrapping          |            |   10:29 |
| \_  Core Functionality     |            | 1d 0:37 |
| \_  Firefighting           |            |    1:54 |
| \_  Cleanup/Refactor       |            |    1:14 |
| \_  Meetings               |            |    2:27 |
#+END:

** Communicating
   :LOGBOOK:
   CLOCK: [2017-09-15 Fri 10:52]--[2017-09-15 Fri 11:34] =>  0:42
   :END:
** Lunch/Breaks
   :LOGBOOK:
   CLOCK: [2017-09-18 Mon 13:16]--[2017-09-18 Mon 13:42] =>  0:26
   CLOCK: [2017-09-15 Fri 12:49]--[2017-09-15 Fri 13:29] =>  0:40
   CLOCK: [2017-09-14 Thu 00:59]--[2017-09-14 Thu 01:07] =>  0:08
   CLOCK: [2017-09-13 Wed 19:51]--[2017-09-13 Wed 20:00] =>  0:09
   CLOCK: [2017-09-13 Wed 16:27]--[2017-09-13 Wed 17:10] =>  0:43
   :END:
** Bootstrapping
   :LOGBOOK:
   CLOCK: [2017-09-13 Wed 22:13]--[2017-09-14 Thu 00:03] =>  1:50
   CLOCK: [2017-09-13 Wed 20:00]--[2017-09-13 Wed 20:53] =>  0:53
   CLOCK: [2017-09-13 Wed 19:13]--[2017-09-13 Wed 19:50] =>  0:37
   CLOCK: [2017-09-13 Wed 19:10]--[2017-09-13 Wed 19:13] =>  0:03
   CLOCK: [2017-09-13 Wed 18:30]--[2017-09-13 Wed 19:10] =>  0:40
   CLOCK: [2017-09-13 Wed 17:51]--[2017-09-13 Wed 18:26] =>  0:35
   CLOCK: [2017-09-13 Wed 17:30]--[2017-09-13 Wed 17:36] =>  0:06
   CLOCK: [2017-09-13 Wed 17:11]--[2017-09-13 Wed 17:15] =>  0:04
   CLOCK: [2017-09-13 Wed 12:52]--[2017-09-13 Wed 16:09] =>  3:17
   CLOCK: [2017-09-13 Wed 12:45]--[2017-09-13 Wed 12:52] =>  0:07
   CLOCK: [2017-09-13 Wed 12:27]--[2017-09-13 Wed 12:44] =>  0:17
   CLOCK: [2017-09-13 Wed 12:17]--[2017-09-13 Wed 12:27] =>  0:10
   CLOCK: [2017-09-13 Wed 10:46]--[2017-09-13 Wed 12:15] =>  1:29
   CLOCK: [2017-09-13 Wed 10:25]--[2017-09-13 Wed 10:46] =>  0:21
   :END:
** Core Functionality
   :LOGBOOK:
   CLOCK: [2017-09-20 Wed 11:56]
   CLOCK: [2017-09-20 Wed 07:51]--[2017-09-20 Wed 11:56] =>  4:05
   CLOCK: [2017-09-19 Tue 12:05]--[2017-09-19 Tue 14:05] =>  2:00
   CLOCK: [2017-09-19 Tue 09:17]--[2017-09-19 Tue 11:09] =>  1:52
   CLOCK: [2017-09-19 Tue 06:27]--[2017-09-19 Tue 09:01] =>  2:34
   CLOCK: [2017-09-18 Mon 18:52]--[2017-09-18 Mon 21:41] =>  2:49
   CLOCK: [2017-09-18 Mon 17:51]--[2017-09-18 Mon 18:52] =>  1:01
   CLOCK: [2017-09-18 Mon 14:34]--[2017-09-18 Mon 16:23] =>  1:49
   CLOCK: [2017-09-18 Mon 13:43]--[2017-09-18 Mon 14:29] =>  0:46
   CLOCK: [2017-09-18 Mon 10:41]--[2017-09-18 Mon 13:07] =>  2:26
   CLOCK: [2017-09-18 Mon 10:17]--[2017-09-18 Mon 10:41] =>  0:24
   CLOCK: [2017-09-15 Fri 13:40]--[2017-09-15 Fri 15:19] =>  1:39
   CLOCK: [2017-09-15 Fri 10:48]--[2017-09-15 Fri 10:48] =>  0:00
   CLOCK: [2017-09-15 Fri 10:09]--[2017-09-15 Fri 10:12] =>  0:03
   CLOCK: [2017-09-14 Thu 13:21]--[2017-09-14 Thu 14:21] =>  1:00
   CLOCK: [2017-09-14 Thu 11:37]--[2017-09-14 Thu 12:54] =>  1:17
   CLOCK: [2017-09-14 Thu 08:14]--[2017-09-14 Thu 09:06] =>  0:52
   CLOCK: [2017-09-14 Thu 06:48]--[2017-09-14 Thu 07:50] =>  1:02
   CLOCK: [2017-09-14 Thu 05:47]--[2017-09-14 Thu 06:48] =>  1:01
   CLOCK: [2017-09-14 Thu 01:07]--[2017-09-14 Thu 02:18] =>  1:11
   CLOCK: [2017-09-14 Thu 00:04]--[2017-09-14 Thu 00:55] =>  0:51
   CLOCK: [2017-09-14 Thu 00:04]--[2017-09-14 Thu 00:04] =>  0:00
   :END:
** Firefighting
   :LOGBOOK:
   CLOCK: [2017-09-14 Thu 10:17]--[2017-09-14 Thu 11:37] =>  1:20
   CLOCK: [2017-09-14 Thu 09:11]--[2017-09-14 Thu 09:45] =>  0:34
   :END:
** Cleanup/Refactor
   :LOGBOOK:
   CLOCK: [2017-09-15 Fri 11:50]--[2017-09-15 Fri 12:37] =>  0:47
   CLOCK: [2017-09-15 Fri 11:34]--[2017-09-15 Fri 11:50] =>  0:16
   CLOCK: [2017-09-15 Fri 10:49]--[2017-09-15 Fri 10:52] =>  0:03
   CLOCK: [2017-09-15 Fri 10:12]--[2017-09-15 Fri 10:20] =>  0:08
   :END:
** Meetings
   :LOGBOOK:
   CLOCK: [2017-09-18 Mon 16:23]--[2017-09-18 Mon 18:16] =>  1:53
   CLOCK: [2017-09-15 Fri 10:14]--[2017-09-15 Fri 10:48] =>  0:34
   :END:
  
* Future bits
** TODO Move credentials to separate file 
** TODO Clean up org documentation
** TODO Make all org-files for source
* Notes   
<2017-09-14 Thu>: Writing changes to the ScheduleStore and making the CSV file an action.
<2017-09-15 Fri>: Starting cleanup on all files. 
<2017-09-15 Fri>: New CSV format for the data.
<2017-09-18 Mon>: The HCP color is #00b0de
